; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-4nodes-1000size-5degree-100mindistance-4trucks-5packages-1171seed

(define (problem transport-two-cities-sequential-4nodes-1000size-5degree-100mindistance-4trucks-5packages-1171seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 419,6 -> 975,198
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 59)
  ; 975,198 -> 419,6
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 59)
  ; 638,836 -> 975,198
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 73)
  ; 975,198 -> 638,836
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 73)
  ; 570,321 -> 975,198
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 43)
  ; 975,198 -> 570,321
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 43)
  ; 570,321 -> 419,6
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 35)
  ; 419,6 -> 570,321
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 35)
  ; 570,321 -> 638,836
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 52)
  ; 638,836 -> 570,321
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 52)
  ; 2260,717 -> 2580,445
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 42)
  ; 2580,445 -> 2260,717
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 42)
  ; 2058,902 -> 2580,445
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 70)
  ; 2580,445 -> 2058,902
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 70)
  ; 2058,902 -> 2260,717
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 28)
  ; 2260,717 -> 2058,902
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 28)
  ; 2943,148 -> 2580,445
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 47)
  ; 2580,445 -> 2943,148
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 47)
  ; 975,198 <-> 2058,902
  (road city-1-loc-1 city-2-loc-3)
  (= (road-length city-1-loc-1 city-2-loc-3) 130)
  (road city-2-loc-3 city-1-loc-1)
  (= (road-length city-2-loc-3 city-1-loc-1) 130)
  (at package-1 city-1-loc-4)
  (at package-2 city-1-loc-3)
  (at package-3 city-1-loc-3)
  (at package-4 city-1-loc-2)
  (at package-5 city-1-loc-4)
  (at truck-1 city-2-loc-3)
  (capacity truck-1 capacity-2)
  (at truck-2 city-2-loc-2)
  (capacity truck-2 capacity-2)
  (at truck-3 city-2-loc-2)
  (capacity truck-3 capacity-2)
  (at truck-4 city-2-loc-4)
  (capacity truck-4 capacity-3)
 )
 (:goal (and
  (at package-1 city-2-loc-4)
  (at package-2 city-2-loc-3)
  (at package-3 city-2-loc-4)
  (at package-4 city-2-loc-2)
  (at package-5 city-2-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-4 city-2-loc-4 city-2-loc-1)
   deleted: (at truck-4 city-2-loc-4)
   added: (at truck-4 city-2-loc-1)
   goals met: 0 of 5
2. (drive truck-4 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-4 city-2-loc-1)
   added: (at truck-4 city-2-loc-3)
   goals met: 0 of 5
3. (drive truck-4 city-2-loc-3 city-1-loc-1)
   deleted: (at truck-4 city-2-loc-3)
   added: (at truck-4 city-1-loc-1)
   goals met: 0 of 5
4. (drive truck-4 city-1-loc-1 city-1-loc-4)
   deleted: (at truck-4 city-1-loc-1)
   added: (at truck-4 city-1-loc-4)
   goals met: 0 of 5
5. (pick-up truck-4 city-1-loc-4 package-1 capacity-2 capacity-3)
   deleted: (at package-1 city-1-loc-4) (capacity truck-4 capacity-3)
   added: (in package-1 truck-4) (capacity truck-4 capacity-2)
   goals met: 0 of 5
6. (drive truck-4 city-1-loc-4 city-1-loc-3)
   deleted: (at truck-4 city-1-loc-4)
   added: (at truck-4 city-1-loc-3)
   goals met: 0 of 5
7. (pick-up truck-4 city-1-loc-3 package-3 capacity-1 capacity-2)
   deleted: (at package-3 city-1-loc-3) (capacity truck-4 capacity-2)
   added: (in package-3 truck-4) (capacity truck-4 capacity-1)
   goals met: 0 of 5
8. (pick-up truck-4 city-1-loc-3 package-2 capacity-0 capacity-1)
   deleted: (at package-2 city-1-loc-3) (capacity truck-4 capacity-1)
   added: (in package-2 truck-4) (capacity truck-4 capacity-0)
   goals met: 0 of 5
9. (drive truck-4 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-4 city-1-loc-3)
   added: (at truck-4 city-1-loc-1)
   goals met: 0 of 5
10. (drive truck-4 city-1-loc-1 city-2-loc-3)
   deleted: (at truck-4 city-1-loc-1)
   added: (at truck-4 city-2-loc-3)
   goals met: 0 of 5
11. (drop truck-4 city-2-loc-3 package-2 capacity-0 capacity-1)
   deleted: (in package-2 truck-4) (capacity truck-4 capacity-0)
   added: (at package-2 city-2-loc-3) (capacity truck-4 capacity-1)
   goals met: 1 of 5
12. (drive truck-4 city-2-loc-3 city-2-loc-1)
   deleted: (at truck-4 city-2-loc-3)
   added: (at truck-4 city-2-loc-1)
   goals met: 1 of 5
13. (drive truck-4 city-2-loc-1 city-2-loc-4)
   deleted: (at truck-4 city-2-loc-1)
   added: (at truck-4 city-2-loc-4)
   goals met: 1 of 5
14. (drop truck-4 city-2-loc-4 package-3 capacity-1 capacity-2)
   deleted: (in package-3 truck-4) (capacity truck-4 capacity-1)
   added: (at package-3 city-2-loc-4) (capacity truck-4 capacity-2)
   goals met: 2 of 5
15. (drop truck-4 city-2-loc-4 package-1 capacity-2 capacity-3)
   deleted: (in package-1 truck-4) (capacity truck-4 capacity-2)
   added: (at package-1 city-2-loc-4) (capacity truck-4 capacity-3)
   goals met: 3 of 5
16. (drive truck-1 city-2-loc-3 city-1-loc-1)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-1-loc-1)
   goals met: 3 of 5
17. (drive truck-1 city-1-loc-1 city-1-loc-2)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-2)
   goals met: 3 of 5
18. (pick-up truck-1 city-1-loc-2 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-1-loc-2) (capacity truck-1 capacity-2)
   added: (in package-4 truck-1) (capacity truck-1 capacity-1)
   goals met: 3 of 5
19. (drive truck-1 city-1-loc-2 city-1-loc-4)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-4)
   goals met: 3 of 5
20. (pick-up truck-1 city-1-loc-4 package-5 capacity-0 capacity-1)
   deleted: (at package-5 city-1-loc-4) (capacity truck-1 capacity-1)
   added: (in package-5 truck-1) (capacity truck-1 capacity-0)
   goals met: 3 of 5
21. (drive truck-1 city-1-loc-4 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-4)
   added: (at truck-1 city-1-loc-1)
   goals met: 3 of 5
22. (drive truck-1 city-1-loc-1 city-2-loc-3)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-2-loc-3)
   goals met: 3 of 5
23. (drop truck-1 city-2-loc-3 package-5 capacity-0 capacity-1)
   deleted: (in package-5 truck-1) (capacity truck-1 capacity-0)
   added: (at package-5 city-2-loc-3) (capacity truck-1 capacity-1)
   goals met: 4 of 5
24. (drive truck-1 city-2-loc-3 city-2-loc-2)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-2)
   goals met: 4 of 5
25. (drop truck-1 city-2-loc-2 package-4 capacity-1 capacity-2)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-1)
   added: (at package-4 city-2-loc-2) (capacity truck-1 capacity-2)
   goals met: 5 of 5
